Autodesk.Revit.DB.Curve.Clone
Returns a copy of this curve.

Autodesk.Revit.DB.Curve.Project(Autodesk.Revit.DB.XYZ)
Projects the specified point on this curve.
point: The point to be projected.
Returns: Geometric information if projection is successful.
Remarks:
The following is the meaning of every IntersectionResult's members:
XYZPoint is the nearest point on the curve;Parameter is the unnormalized parameter on the curve (use ComputeNormalizedParameter to compute the normalized value)Distance is the distance from the point to the curve (equivalent to Distance).
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when failed to find the closest point on the curve.

Autodesk.Revit.DB.Curve.CreateOffset(System.Double,Autodesk.Revit.DB.XYZ)
Creates a new curve that is an offset of the existing curve.
offsetDist:
The signed distance of the offset.
normal:
The normal of the plane defining the offset direction.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Failed to create the offset.
Returns:
The new curve.
Since:
2015
Remarks:
The offset curve is theoretically defined by translating every point of the original curve by the vector offsetDist * (curveTan x normal)
of the curve by the signed offset distance offsetDist, within the plane of the curve. The "right" side of the curve at a given point on the
curve is defined with reference to normal being thought of as the upward direction and curveTan being thought of as the forward direction,
as if you are walking along the curve. It follows that if offsetDist is positive, points will be offset to the right of the curve, whereas
if offsetDist is negative, points will be offset to the left of the curve.

Autodesk.Revit.DB.Curve.MakeUnbound
Makes this curve unbound.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when the object is internally marked as read-only.

Autodesk.Revit.DB.Curve.MakeBound(System.Double,System.Double)
Changes the bounds of this curve to the specified values.
startParameter: The new parameter of the start point.
endParameter: The new parameter of the end point.
Remarks: This method changes this curve to bound.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when the specified values are infinite.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Thrown when endParameter is smaller than startParameter,
or the object is internally marked as read-only.

Autodesk.Revit.DB.Curve.GetEndParameter(System.Int32)
Returns the raw parameter value at the start or end of this curve.
index:
0 for the start or 1 for end of the curve.
Returns:
The parameter.
Throws Autodesk.Revit.Exceptions.ArgumentException:
curve is unbound and does not have start and end points.
-or-
index must be 0 for the start of the curve or 1 for the end.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.DB.Curve.Reference
Returns a stable reference to the curve.
This value is set for curve geometry obtained from Revit elements.
null if the curve was created via parameters, copying, transform, or other operations.